//配列の宣言と値の代入を行う
var holidays = ["正月","成人の日","建国記念日","天皇誕生日","春分の日","昭和の日","憲法記念日","みどりの日","こどもの日","海の日","山の日","敬老の日","秋分の日","スポーツの日","文化の日","勤労感謝の日"];

//for文で祝日を順番に表示

for (let i = 0; i < holidays.length < 15; i++) {

console.log(holidays[i]);
    
}

//配列の宣言と値の代入を行う
var holidays = ["正月","成人の日","建国記念日","天皇誕生日","春分の日","昭和の日","憲法記念日","みどりの日","こどもの日","海の日","山の日","敬老の日","秋分の日","スポーツの日","文化の日","勤労感謝の日"];

//while文で祝日を順番に表示

var i = 0;

while( i < holidays.length ) {
  
  if (holidays[i] == 15) break;

  console.log(holidays[i]); i++;

}